%**************************************************************************
%   Name: yeh_verify_WinGLink_ImpedancesToAppResPhs_v20230903a.m 
%   Copyright:  
%   Author: HsiupoYeh 
%   Version: v20230903a
%   Description: 驗證從WinGLink中推敲出來的轉換公式。當阻抗張量傾子及其VAR欄位
%                確定時，部分公式沒有找到文件描述，用硬猜得找出其繪圖用的數值與
%                誤差計算公式，其中有幾組係數存在的原因我並不清楚，以某測站的阻
%                抗資料匯入WinGLink後對比計算結果。結果完全一致。
%                經過測試可用於MATLAB R2014a版本。
%**************************************************************************
clear;clc;close all
%==========================================================================
% WinGLink IMPEDANCES to APPARENT RESISTIVITIES AND PHASES
% 說明:
% WinGLink輸出的EDI檔案我稱之為「ImpedanceTipperEdi」，是有複數的阻抗張量(Impedance)
% 及其VAR，也有複數的傾子(Tipper)。根據「Kelbert, A. (2020). EMTF XML: New data 
% interchange format and conversion tools for electromagnetic transfer functions. 
% Geophysics, 85(1), F1-F17.」指出，這種EDI檔案因為不儲存逆訊號功率矩陣(inverse signal power matrix)
% 與殘差值的共變異數矩陣(residual covariance matrix)，因此VAR項目在進行旋轉後就
% 變得不太正確。因為目前三維逆推都要求所有測站在同樣地座標系，常見的慣例就是將測站
% 旋轉至X朝北Y朝東，以方位角標註為0，也就是ROT=0，所以採用「ImpedanceTipperEdi」
% 來儲存檔案的時候，強烈建議保存ROT=0的檔案。這也是Kelbert, A. (2020).目前選擇的
% 策略。
% 首先介紹基本必須存在的重要項目，這些項目是來自於線性回歸的統計運算，最終儲存下
% 來的內容，但EDI檔案為了解省空間並沒有很好的標註單位，這裡將參考Kelbert, A. (2020)
% 整理的單位在這裡重新說明一次:
% 「>FREQ」為各項資料的代表頻率(頻譜分析通常要選中心頻率及頻寬範圍)，單位:[Hz]。
%
% 「>ZROT」為阻抗張量的旋轉角度，與方位角(Azimuth)相同描述，正北=0度，正東=90度
% ，單位:[度]。在現在的儲存策略中，這項應該全都是0，表示所有頻率都朝正北。此項是
% 必要資料，從前一個統計運算步驟得到的。
%
% 「>ZXXR」、「>ZXXI」分別為阻抗張量的Zxx元素的實部與虛部，這兩項組合成一個複數
% 單位為[(mV/km)/nT]。硬要說的話，實部、虛部與複數都是相同單位。此項是必要資料，
% 從前一個統計運算步驟得到的。
%
% 「>ZXX.VAR」，是一個變異數，描述隨機變數Zxx的離散程度，這裡依照EDI文件的定義，
% 是一個實數(沒有虛部)。依照Kelbert, A. (2020)整理的結果，這個數值要透過逆訊號功
% 率矩陣(inverse signal power matrix)與殘差值的共變異數矩陣(residual covariance matrix)
% 來計算而成，但EDI檔案並沒有要儲存的意思。單位沒有文獻整理，推測是沒有物理意義，
% 也沒有繪圖的需求，這裡就先不探究。此項是必要資料，從前一個統計運算步驟得到的。
% 
% 同理，「>ZXYR」、「>ZXYI」分別為阻抗張量的Zxy元素的實部與虛部，這兩項組合成一
% 個複數單位為[(mV/km)/nT]。此項是必要資料，從前一個統計運算步驟得到的。
% 同理，「>ZYXR」、「>ZYXI」分別為阻抗張量的Zyx元素的實部與虛部，這兩項組合成一
% 個複數單位為[(mV/km)/nT]。此項是必要資料，從前一個統計運算步驟得到的。
% 同理，「>ZYYR」、「>ZYYI」分別為阻抗張量的Zyy元素的實部與虛部，這兩項組合成一
% 個複數單位為[(mV/km)/nT]。此項是必要資料，從前一個統計運算步驟得到的。
% 同理，「>ZXY.VAR」，是一個變異數，描述隨機變數Zxy的離散程度，是一個實數(沒有虛
% 部)，忽略單位資訊。此項是必要資料，從前一個統計運算步驟得到的。
% 同理，「>ZYX.VAR」，是一個變異數，描述隨機變數Zyx的離散程度，是一個實數(沒有虛
% 部)，忽略單位資訊。此項是必要資料，從前一個統計運算步驟得到的。
% 同理，「>ZYY.VAR」，是一個變異數，描述隨機變數Zyy的離散程度，是一個實數(沒有虛
% 部)，忽略單位資訊。此項是必要資料，從前一個統計運算步驟得到的。
%
% 「>RHOROT」為視電阻率及相位的旋轉角度，與方位角(Azimuth)相同描述，正北=0度，正
% 東=90度，單位:[度]。在現在的儲存策略中，這項應該全都是0，表示所有頻率都朝正北。
% 此項多數情況下是從「>ZROT」抄來的，因為通常不會在同一個檔案裡對同個頻率套用不同
% 角度。例如阻抗張量與視電阻率旋轉角度通常是一致的。此項是後算資料，但目前習慣與
% 「>ZROT」一致。
% 
% 「>RHOXY」為視電阻率，單位:[Ohm-m]，正實數。要注意的是EDI文件的公式並不適合，
% 其阻抗張量單位是[Ohm]，請另外去找阻抗張量的單位為[(mV/km)/nT]的運算公式。這個
% 數值要繪圖的時候，通常繪製在雙對數軸上，因此要記得取log10才去繪圖。此項是後算資
% 料，由「>ZXYR」、「>ZXYI」求出。
% 「>RHOXY.ERR」為log10尺度下的誤差棒數值，單位是[10^x Ohm-m]。依照EDI文件的說
% 明，這個誤差棒是上下對稱型，而且是在log10尺度下等長。這樣狀況下的判讀可能要更小
% 心一點。此項是後算資料，由「>ZXYR」、「>ZXYI」、「>ZXY.VAR」求出。不過沒有查到
% 文獻有寫怎麼計算，只好從WinGLink軟體去猜。詭異的是XY、YX與XX、YY算法不一樣。
% 
% 同理，「>RHOYX」為視電阻率，單位:[Ohm-m]，正實數。此項是後算資料，由「>ZYXR」
% 、「>ZYXI」求出。
% 「>RHOYX.ERR」為log10尺度下的誤差棒數值，單位是[10^x Ohm-m]。此項是後算資料，
% 由「>ZYXR」、「>ZYXI」、「>ZYX.VAR」求出。
% 同理，「>RHOXX」為視電阻率，單位:[Ohm-m]，正實數。此項是後算資料，由「>ZXXR」
% 、「>ZXXI」求出。
% 「>RHOXX.ERR」為log10尺度下的誤差棒數值，單位是[10^x Ohm-m]。此項是後算資料，
% 由「>ZXXR」、「>ZXXI」、「>ZXX.VAR」求出。
% 同理，「>RHOYY」為視電阻率，單位:[Ohm-m]，正實數。此項是後算資料，由「>ZYYR」
% 、「>ZYYI」求出。
% 「>RHOYY.ERR」為log10尺度下的誤差棒數值，單位是[10^x Ohm-m]。此項是後算資料，
% 由「>ZYYR」、「>ZYYI」、「>ZYY.VAR」求出。
%
% 「>PHSXY」為相位，單位:[度]。這個數值要繪圖的時候，通常繪製在線性軸上，範圍習慣
% 上用-180度~180度，來涵蓋一個360度，頻率軸維持對數尺度。此項是後算資料，由「>ZXYR」
% 、「>ZXYI」求出。
% 「>PHSXY.ERR」為線性尺度下的誤差棒數值，單位是[度]。此項是後算資料，由「>ZXYR」
% 、「>ZXYI」、「>ZXY.VAR」求出。不過沒有查到文獻有寫怎麼計算，只好從WinGLink軟
% 體去猜。詭異的是XY、YX與XX、YY算法不一樣。
% 
% 同理，「>PHSYX」為相位，單位:[度]。此項是後算資料，由「>ZYXR」、「>ZYXI」求出。
% 「>PHSYX.ERR」為線性尺度下的誤差棒數值，單位是[度]。此項是後算資料，由「>ZYXR」
% 、「>ZYXI」、「>ZYX.VAR」求出。
% 同理，「>PHSXX」為相位，單位:[度]。此項是後算資料，由「>ZXXR」、「>ZXXI」求出。
% 「>PHSXX.ERR」為線性尺度下的誤差棒數值，單位是[度]。此項是後算資料，由「>ZXXR」
% 、「>ZXXI」、「>ZXX.VAR」求出。
% 同理，「>PHSYY」為相位，單位:[度]。此項是後算資料，由「>ZYYR」、「>ZYYI」求出。
% 「>PHSYY.ERR」為線性尺度下的誤差棒數值，單位是[度]。此項是後算資料，由「>ZYYR」
% 、「>ZYYI」、「>ZYY.VAR」求出。
%
% 「>TROT.EXP」為傾子的旋轉角度，與方位角(Azimuth)相同描述，正北=0度，正東=90度
% ，單位:[度]。在現在的儲存策略中，這項應該全都是0，表示所有頻率都朝正北。
% 此項多數情況下是從「>ZROT」抄來的，因為通常不會在同一個檔案裡對同個頻率套用不同
% 角度。例如阻抗張量與視電阻率旋轉角度通常是一致的。此項是後算資料，但目前習慣與
% 「>ZROT」一致。
%
% 「>TXR.EXP」、「>TXI.EXP」分別為傾子的Tx元素的實部與虛部，這兩項組合成一個複數
% 單位為[無單位]。硬要說的話，實部、虛部與複數都是相同單位。此項是必要資料，從前
% 一個統計運算步驟得到的。許多軟體選擇直接繪製傾子的實部虛部圖，在線性尺度下畫圖，
% 頻率軸維持對數尺度。
% 「>TXVAR.EXP」，是一個變異數，描述隨機變數Tx的離散程度，這裡依照EDI文件並沒有定
% 義，但參考計算公式，這應該是一個實數(沒有虛部)。依照Kelbert, A. (2020)整理的結
% 果，這個數值要透過逆訊號功率矩陣(inverse signal power matrix)與殘差值的共變異
% 數矩陣(residual covariance matrix)來計算而成，但EDI檔案並沒有要儲存的意思。單
% 位[無單位]。此項是必要資料，從前一個統計運算步驟得到的。許多軟體選擇直接繪製傾
% 子的實部虛部圖，在線性尺度下畫圖，頻率軸維持對數尺度，直接用這個值畫誤差棒，誤
% 差棒上下對稱。
%
% 同理，「>TYR.EXP」、「>TYI.EXP」分別為傾子的Tx元素的實部與虛部，這兩項組合成一
% 個複數單位為[無單位]。此項是必要資料，從前一個統計運算步驟得到的。
% 「>TYVAR.EXP」，是一個變異數，描述隨機變數Ty的離散程度，這裡依照EDI文件並沒有定
% 義，但參考計算公式，這應該是一個實數(沒有虛部)。此項是必要資料，從前一個統計運算
% 步驟得到的。
%
% 「>TIPMAG」為傾子全場強度，單位:[無單位]。這個數值要繪圖的時候，通常繪製在線性
% 軸上，頻率軸維持對數尺度。此項是後算資料，由「>TXR.EXP」、「>TXI.EXP」、「>TYR.EXP」
% 、「>TYI.EXP」求出。EDI文件有說明如何計算。少數軟體選擇用這個值，在線性尺度下畫
% 圖，頻率軸維持對數尺度。
%
% 「>TIPMAG.VAR」為線性尺度下的誤差棒數值，單位是[度]。此項是後算資料，由「>TXVAR.EXP」
% 、「>TYVAR.EXP」求出。不過沒有查到文獻有寫怎麼計算，只好從WinGLink軟體去猜。少
% 數% 軟體選擇用這個值，在線性尺度下畫圖，頻率軸維持對數尺度。
%
% 「>TIPPHS」為傾子全場相位，單位:[度]。這個數值要繪圖的時候，通常繪製在線性軸上
% ，範圍習慣上用-180度~180度，來涵蓋一個360度，頻率軸維持對數尺度。此項是後算資料
% ，由「>TXR.EXP」、「>TXI.EXP」、「>TYR.EXP」、「>TYI.EXP」求出。EDI文件有說明
% 如何計算。少數軟體選擇用這個值，在線性尺度下畫圖，頻率軸維持對數尺度。至於他對應
% 的「>TIPPHS.ERR」居然WinGLink沒有輸出，所以我也不知道這怎麼來的，這裡略過。
%
% 因此，Tipper系列繪圖恐怕只能繪製Tx、Ty的實部與虛部圖含誤差棒。
%==========================================================================
%--------------------------------------------------------------------------
% 以下示範公式內容及正確性驗證。
%--------------------------------------------------------------------------
% WinGLink檔案內容:
% >!****FREQUENCIES****!
% >FREQ //80
%  3.176470e+02  2.647059e+02  2.294118e+02  1.941176e+02  1.588235e+02  1.323529e+02 
%  1.147059e+02  9.705883e+01  7.941176e+01  6.499999e+01  5.499999e+01  4.500000e+01
FREQ=[
 3.176470e+02  2.647059e+02  2.294118e+02  1.941176e+02  1.588235e+02  1.323529e+02 
 1.147059e+02  9.705883e+01  7.941176e+01  6.499999e+01  5.499999e+01  4.500000e+01
];
%--
% WinGLink檔案內容:
% >!****IMPEDANCE ROTATION ANGLES****!
% >ZROT //80
%  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00 
%  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
ZROT=[
 0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00 
 0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
];
%--
% WinGLink檔案內容:
% >!****IMPEDANCES****!
% >ZXXR ROT=ZROT //12
% -5.265020e+02 -3.593720e+02 -9.043188e+02 -1.973233e+02 -1.629993e+02 -9.664582e+01 
%  3.679142e+02 -7.785728e+01 -6.688672e+01 -6.864721e+02  1.276324e+02 -6.297473e+01 
ZXXR=[
-5.265020e+02 -3.593720e+02 -9.043188e+02 -1.973233e+02 -1.629993e+02 -9.664582e+01 
 3.679142e+02 -7.785728e+01 -6.688672e+01 -6.864721e+02  1.276324e+02 -6.297473e+01 
];
%--
% WinGLink檔案內容:
% >ZXXI ROT=ZROT //12
%  4.506487e+02 -4.804145e+01 -8.286099e+02  4.693495e+01  1.471286e+00  7.485280e+02 
% -2.001921e+02 -2.611000e+01 -5.274361e+01 -5.353542e+02 -3.124358e+02 -1.664831e+00 
ZXXI=[
 4.506487e+02 -4.804145e+01 -8.286099e+02  4.693495e+01  1.471286e+00  7.485280e+02 
-2.001921e+02 -2.611000e+01 -5.274361e+01 -5.353542e+02 -3.124358e+02 -1.664831e+00 
];
%--
% WinGLink檔案內容:
% >ZXX.VAR ROT=ZROT //12
%  2.806232e+01  1.837430e+02  1.420672e+03  1.196283e+01  1.891042e+00  2.537648e+01 
%  1.336798e+04  2.562492e+01  2.050326e+01  4.238854e+02  1.045631e+03  2.683362e+00 
ZXXVAR=[
 2.806232e+01  1.837430e+02  1.420672e+03  1.196283e+01  1.891042e+00  2.537648e+01 
 1.336798e+04  2.562492e+01  2.050326e+01  4.238854e+02  1.045631e+03  2.683362e+00 
];
%--
% WinGLink檔案內容:
% >ZXYR ROT=ZROT //12
%  4.882241e+02  2.581502e+02  1.859248e+02  1.201162e+02  2.635167e+02  1.085036e+02 
%  3.000113e+02  2.451520e+02  1.630430e+02  1.766326e+02  2.110615e+02  1.073728e+02 
ZXYR=[
 4.882241e+02  2.581502e+02  1.859248e+02  1.201162e+02  2.635167e+02  1.085036e+02 
 3.000113e+02  2.451520e+02  1.630430e+02  1.766326e+02  2.110615e+02  1.073728e+02 
];
%--
% WinGLink檔案內容:
% >ZXYI ROT=ZROT //12
%  1.609857e+02  4.228473e+02  4.255936e+02  4.330425e+02  2.759757e+02  3.307851e+02 
% -1.180900e+02  1.683705e+02  2.312816e+02  1.766784e+02  1.232979e+02  2.043426e+02 
ZXYI=[
 1.609857e+02  4.228473e+02  4.255936e+02  4.330425e+02  2.759757e+02  3.307851e+02 
-1.180900e+02  1.683705e+02  2.312816e+02  1.766784e+02  1.232979e+02  2.043426e+02 
];
%--
% WinGLink檔案內容:
% >ZXY.VAR ROT=ZROT //12
%  5.458148e+00  6.705733e+01  1.428897e+02  1.514779e+01  1.418815e+00  7.315428e+00 
%  2.729888e+03  1.510913e+01  2.060527e+01  2.118610e+02  3.912234e+02  6.255560e+00 
ZXYVAR=[
 5.458148e+00  6.705733e+01  1.428897e+02  1.514779e+01  1.418815e+00  7.315428e+00 
 2.729888e+03  1.510913e+01  2.060527e+01  2.118610e+02  3.912234e+02  6.255560e+00 
];
%--
% WinGLink檔案內容:
% >ZYXR ROT=ZROT //12
% -2.879981e+02 -2.357159e+02 -3.554887e+02 -2.052731e+02 -2.918802e+02 -2.706219e+02 
% -2.508479e+02 -1.761404e+02 -1.831432e+02 -1.650766e+02 -1.613711e+02 -1.449979e+02 
ZYXR=[
-2.879981e+02 -2.357159e+02 -3.554887e+02 -2.052731e+02 -2.918802e+02 -2.706219e+02 
-2.508479e+02 -1.761404e+02 -1.831432e+02 -1.650766e+02 -1.613711e+02 -1.449979e+02 
];
%--
% WinGLink檔案內容:
% >ZYXI ROT=ZROT //12
%  3.287881e+02 -3.248358e+02 -1.504646e+02 -3.166334e+02 -1.515667e+02 -1.357007e+02 
% -8.767198e+01 -1.914402e+02 -1.638135e+02 -1.404277e+02 -1.102846e+02 -1.028255e+02 
ZYXI=[
 3.287881e+02 -3.248358e+02 -1.504646e+02 -3.166334e+02 -1.515667e+02 -1.357007e+02 
-8.767198e+01 -1.914402e+02 -1.638135e+02 -1.404277e+02 -1.102846e+02 -1.028255e+02 
];
%--
% WinGLink檔案內容:
% >ZYX.VAR ROT=ZROT //12
%  3.975481e+01  1.059726e+02  2.788341e+02  1.131907e+01  8.819130e-01  8.267913e+00 
%  5.519565e+03  1.594469e+01  7.694871e+00  5.705239e+01  2.269735e+02  2.291480e+00 
ZYXVAR=[
 3.975481e+01  1.059726e+02  2.788341e+02  1.131907e+01  8.819130e-01  8.267913e+00 
 5.519565e+03  1.594469e+01  7.694871e+00  5.705239e+01  2.269735e+02  2.291480e+00 
];
%--
% WinGLink檔案內容:
% >ZYYR ROT=ZROT //12
% -2.060001e+02  8.475530e+01  1.173526e+02  2.129884e+02  7.035958e+01  5.000554e+01 
%  9.088226e+01  1.628149e+02  3.720795e+01  2.471980e+02  3.508348e+01  2.031241e+01 
ZYYR=[
-2.060001e+02  8.475530e+01  1.173526e+02  2.129884e+02  7.035958e+01  5.000554e+01 
 9.088226e+01  1.628149e+02  3.720795e+01  2.471980e+02  3.508348e+01  2.031241e+01 
];
%--
% WinGLink檔案內容:
% >ZYYI ROT=ZROT //12
% -3.382410e+02  1.202547e+01 -1.104633e+02  1.821516e+00  1.306933e+02  8.587952e+01 
%  2.566165e+01 -4.402713e+01  2.512477e+01  1.898178e+01 -1.460141e+01  9.593735e+01 
ZYYI=[
-3.382410e+02  1.202547e+01 -1.104633e+02  1.821516e+00  1.306933e+02  8.587952e+01 
 2.566165e+01 -4.402713e+01  2.512477e+01  1.898178e+01 -1.460141e+01  9.593735e+01 
];
%--
% WinGLink檔案內容:
% >ZYY.VAR ROT=ZROT //12
%  7.732347e+00  3.867490e+01  2.804484e+01  1.433265e+01  6.616835e-01  2.383440e+00 
%  1.127155e+03  9.401410e+00  7.733157e+00  2.851520e+01  8.492222e+01  5.341989e+00 
ZYYVAR=[
 7.732347e+00  3.867490e+01  2.804484e+01  1.433265e+01  6.616835e-01  2.383440e+00 
 1.127155e+03  9.401410e+00  7.733157e+00  2.851520e+01  8.492222e+01  5.341989e+00 
];
%--
% WinGLink檔案內容:
% >!****APPARENT RESISTIVITIES AND PHASES****!
% >RHOXY ROT=RHOROT //12
%  1.663980e+02  1.854446e+02  1.880443e+02  2.080736e+02  1.833527e+02  1.831343e+02 
%  1.812496e+02  1.822567e+02  2.016684e+02  1.920441e+02  2.172703e+02  2.368214e+02 
RHOXY=[
 1.663980e+02  1.854446e+02  1.880443e+02  2.080736e+02  1.833527e+02  1.831343e+02 
 1.812496e+02  1.822567e+02  2.016684e+02  1.920441e+02  2.172703e+02  2.368214e+02 
];
disp('RHOXY =')
disp(RHOXY)
% 展示WinGLink資料:
% RHOXY =
%   166.3980  185.4446  188.0443  208.0736  183.3527  183.1343
%   181.2496  182.2567  201.6684  192.0441  217.2703  236.8214
yeh_RHOXY=0.2.*(abs(complex(ZXYR,ZXYI)).^2)./FREQ;
disp('yeh_RHOXY =')
disp(yeh_RHOXY)
% 展示驗證結果:
% yeh_RHOXY =
%   166.3980  185.4446  188.0443  208.0736  183.3528  183.1344
%   181.2497  182.2567  201.6684  192.0441  217.2703  236.8214
%--
% WinGLink檔案內容:
% >RHOXY.ERR ROT=RHOROT //12
%  2.791110e-03  1.015161e-02  1.580750e-02  5.319056e-03  1.917179e-03  4.771655e-03 
%  9.952720e-02  8.027148e-03  9.852099e-03  3.578238e-02  4.969718e-02  6.654527e-03 
RHOXYERR=[
 2.791110e-03  1.015161e-02  1.580750e-02  5.319056e-03  1.917179e-03  4.771655e-03 
 9.952720e-02  8.027148e-03  9.852099e-03  3.578238e-02  4.969718e-02  6.654527e-03 
];
disp('RHOXYERR =')
disp(RHOXYERR)
% 展示WinGLink資料:
% RHOXYERR =
%     0.0028    0.0102    0.0158    0.0053    0.0019    0.0048
%     0.0995    0.0080    0.0099    0.0358    0.0497    0.0067
RHOXYYXERR_coefficient=6.141661E-01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_RHOXYERR=RHOXYYXERR_coefficient.*sqrt(ZXYVAR)./abs(complex(ZXYR,ZXYI));
disp('yeh_RHOXYERR =')
disp(yeh_RHOXYERR)
% 展示驗證結果:
% yeh_RHOXYERR =
%     0.0028    0.0102    0.0158    0.0053    0.0019    0.0048
%     0.0995    0.0080    0.0099    0.0358    0.0497    0.0067
%--
% WinGLink檔案內容:
% >RHOYX ROT=RHOROT //12
%  1.202873e+02  1.217051e+02  1.299077e+02  1.467087e+02  1.362097e+02  1.384947e+02 
%  1.231167e+02  1.394510e+02  1.520588e+02  1.445238e+02  1.389212e+02  1.404332e+02 
RHOYX=[
 1.202873e+02  1.217051e+02  1.299077e+02  1.467087e+02  1.362097e+02  1.384947e+02 
 1.231167e+02  1.394510e+02  1.520588e+02  1.445238e+02  1.389212e+02  1.404332e+02 
];
disp('RHOYX =')
disp(RHOYX)
% 展示WinGLink資料:
% RHOYX =
%   120.2873  121.7051  129.9077  146.7087  136.2097  138.4947
%   123.1167  139.4510  152.0588  144.5238  138.9212  140.4332
yeh_RHOYX=0.2.*(abs(complex(ZYXR,ZYXI)).^2)./FREQ;
disp('yeh_RHOYX =')
disp(yeh_RHOYX)
% 展示驗證結果:
% yeh_RHOYX =
%   120.2873  121.7051  129.9077  146.7088  136.2097  138.4947
%   123.1167  139.4511  152.0588  144.5238  138.9212  140.4332
%--
% WinGLink檔案內容:
% >RHOYX.ERR ROT=RHOROT //12
%  8.859585e-03  1.575293e-02  2.656736e-02  5.475778e-03  1.753688e-03  5.833315e-03 
%  1.717125e-01  9.427154e-03  6.933512e-03  2.140481e-02  4.733940e-02  5.230193e-03 
RHOYXERR=[
 8.859585e-03  1.575293e-02  2.656736e-02  5.475778e-03  1.753688e-03  5.833315e-03 
 1.717125e-01  9.427154e-03  6.933512e-03  2.140481e-02  4.733940e-02  5.230193e-03 
];
disp('RHOYXERR =')
disp(RHOYXERR)
% 展示WinGLink資料:
% RHOYXERR =
%     0.0089    0.0158    0.0266    0.0055    0.0018    0.0058
%     0.1717    0.0094    0.0069    0.0214    0.0473    0.0052
RHOXYYXERR_coefficient=6.141661E-01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_RHOYXERR=RHOXYYXERR_coefficient.*sqrt(ZYXVAR)./abs(complex(ZYXR,ZYXI));
disp('yeh_RHOYXERR =')
disp(yeh_RHOYXERR)
% 展示驗證結果:
% yeh_RHOYXERR =
%     0.0089    0.0158    0.0266    0.0055    0.0018    0.0058
%     0.1717    0.0094    0.0069    0.0214    0.0473    0.0052
%--
% WinGLink檔案內容:
% >RHOXX ROT=RHOROT //12
%  3.024038e+02  9.932247e+01  1.311517e+03  4.238602e+01  3.345970e+01  8.607813e+02 
%  3.058914e+02  1.389567e+01  1.827367e+01  2.331840e+03  4.142043e+02  1.763817e+01 
RHOXX=[
 3.024038e+02  9.932247e+01  1.311517e+03  4.238602e+01  3.345970e+01  8.607813e+02 
 3.058914e+02  1.389567e+01  1.827367e+01  2.331840e+03  4.142043e+02  1.763817e+01 
];
disp('RHOXX =')
disp(RHOXX)
% 展示WinGLink資料:
% RHOXX =
%    1.0e+03 *
% 
%     0.3024    0.0993    1.3115    0.0424    0.0335    0.8608
%     0.3059    0.0139    0.0183    2.3318    0.4142    0.0176
yeh_RHOXX=0.2.*(abs(complex(ZXXR,ZXXI)).^2)./FREQ;
disp('yeh_RHOXX =')
disp(yeh_RHOXX)
% 展示驗證結果:
% yeh_RHOXX =
%    1.0e+03 *
% 
%     0.3024    0.0993    1.3115    0.0424    0.0335    0.8608
%     0.3059    0.0139    0.0183    2.3318    0.4142    0.0176
%--
% WinGLink檔案內容:
% >RHOXX.ERR ROT=RHOROT //12
%  2.203906e-05  5.272315e-04  3.562099e-04  1.096852e-04  2.684517e-05  1.680378e-05 
%  2.874184e-02  1.433342e-03  1.065894e-03  2.109784e-04  3.462606e-03  2.550439e-04 
RHOXXERR=[
 2.203906e-05  5.272315e-04  3.562099e-04  1.096852e-04  2.684517e-05  1.680378e-05 
 2.874184e-02  1.433342e-03  1.065894e-03  2.109784e-04  3.462606e-03  2.550439e-04 
];
disp('RHOXXERR =')
disp(RHOXXERR)
% 展示WinGLink資料:
% RHOXXERR =
%     0.0000    0.0005    0.0004    0.0001    0.0000    0.0000
%     0.0287    0.0014    0.0011    0.0002    0.0035    0.0003
RHOXXYYXERR_coefficient=3.772000e-01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_RHOXXERR=RHOXXYYXERR_coefficient.*(ZXXVAR)./(abs(complex(ZXXR,ZXXI).^2));
disp('yeh_RHOXXERR =')
disp(yeh_RHOXXERR)
% 展示驗證結果:
% yeh_RHOXXERR =
%     0.0000    0.0005    0.0004    0.0001    0.0000    0.0000
%     0.0287    0.0014    0.0011    0.0002    0.0035    0.0003
%--
% WinGLink檔案內容:
% >RHOYY ROT=RHOROT //80
%  9.875300e+01  5.536766e+00  2.264380e+01  4.674215e+01  2.774300e+01  1.492350e+01 
%  1.554951e+01  5.861824e+01  5.076541e+00  1.891297e+02  5.251096e+00  4.274031e+01 
RHOYY=[
 9.875300e+01  5.536766e+00  2.264380e+01  4.674215e+01  2.774300e+01  1.492350e+01 
 1.554951e+01  5.861824e+01  5.076541e+00  1.891297e+02  5.251096e+00  4.274031e+01 
];
disp('RHOYY =')
disp(RHOYY)
% 展示WinGLink資料:
% RHOYY =
%    98.7530    5.5368   22.6438   46.7422   27.7430   14.9235
%    15.5495   58.6182    5.0765  189.1297    5.2511   42.7403
yeh_RHOYY=0.2.*(abs(complex(ZYYR,ZYYI)).^2)./FREQ;
disp('yeh_RHOYY =')
disp(yeh_RHOYY)
% 展示驗證結果:
% yeh_RHOYY =
%    98.7530    5.5368   22.6438   46.7422   27.7430   14.9235
%    15.5495   58.6182    5.0765  189.1297    5.2511   42.7403
%--
% WinGLink檔案內容:
% >RHOYY.ERR ROT=RHOROT //12
%  1.859593e-05  1.990724e-03  4.072767e-04  1.191666e-04  1.132880e-05  9.103357e-05 
%  4.767414e-02  1.246599e-04  1.447124e-03  1.749867e-04  2.218249e-02  2.095340e-04 
RHOYYERR=[
 1.859593e-05  1.990724e-03  4.072767e-04  1.191666e-04  1.132880e-05  9.103357e-05 
 4.767414e-02  1.246599e-04  1.447124e-03  1.749867e-04  2.218249e-02  2.095340e-04 
];
disp('RHOYYERR =')
disp(RHOYYERR)
% 展示WinGLink資料:
% RHOYYERR =
%     0.0000    0.0020    0.0004    0.0001    0.0000    0.0001
%     0.0477    0.0001    0.0014    0.0002    0.0222    0.0002
RHOXXYYXERR_coefficient=3.772000e-01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_RHOYYERR=RHOXXYYXERR_coefficient.*(ZYYVAR)./(abs(complex(ZYYR,ZYYI).^2));
disp('yeh_RHOYYERR =')
disp(yeh_RHOYYERR)
% 展示驗證結果:
% yeh_RHOYYERR =
%     0.0000    0.0020    0.0004    0.0001    0.0000    0.0001
%     0.0477    0.0001    0.0014    0.0002    0.0222    0.0002
%--
% WinGLink檔案內容:
% >PHSXY ROT=RHOROT //12
%  1.824932e+01  5.859574e+01  6.640141e+01  7.449719e+01  4.632295e+01  7.183955e+01 
% -2.148552e+01  3.448129e+01  5.481791e+01  4.500743e+01  3.029262e+01  6.228009e+01 
PHSXY=[
 1.824932e+01  5.859574e+01  6.640141e+01  7.449719e+01  4.632295e+01  7.183955e+01 
-2.148552e+01  3.448129e+01  5.481791e+01  4.500743e+01  3.029262e+01  6.228009e+01 
];
disp('PHSXY =')
disp(PHSXY)
% 展示WinGLink資料:
% PHSXY =
%    18.2493   58.5957   66.4014   74.4972   46.3229   71.8396
%   -21.4855   34.4813   54.8179   45.0074   30.2926   62.2801
yeh_PHSXY=angle(complex(ZXYR,ZXYI))*180/pi;
disp('yeh_PHSXY =')
disp(yeh_PHSXY)
% 展示驗證結果:
% yeh_PHSXY =
%    18.2493   58.5957   66.4014   74.4972   46.3229   71.8396
%   -21.4855   34.4813   54.8179   45.0074   30.2926   62.2801
%--
% WinGLink檔案內容:
% >PHSXY.ERR ROT=RHOROT //12
%  1.841191e-01  6.696638e-01  1.042762e+00  3.508780e-01  1.264691e-01  3.147683e-01 
%  6.565436e+00  5.295209e-01  6.499060e-01  2.360430e+00  3.278337e+00  4.389742e-01 
PHSXYERR=[
 1.841191e-01  6.696638e-01  1.042762e+00  3.508780e-01  1.264691e-01  3.147683e-01 
 6.565436e+00  5.295209e-01  6.499060e-01  2.360430e+00  3.278337e+00  4.389742e-01 
];
disp('PHSXYERR =')
disp(PHSXYERR)
% 展示WinGLink資料:
% PHSXYERR =
%     0.1841    0.6697    1.0428    0.3509    0.1265    0.3148
%     6.5654    0.5295    0.6499    2.3604    3.2783    0.4390
PHSXYYXERR_coefficient=4.051423e+01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_PHSXYERR=PHSXYYXERR_coefficient.*sqrt(ZXYVAR)./(abs(complex(ZXYR,ZXYI)));
disp('yeh_PHSXYERR =')
disp(yeh_PHSXYERR)
% 展示驗證結果:
% yeh_PHSXYERR =
%     0.1841    0.6697    1.0428    0.3509    0.1265    0.3148
%     6.5654    0.5295    0.6499    2.3604    3.2783    0.4390
%--
% WinGLink檔案內容:
% >PHSYX ROT=RHOROT //12
%  1.312164e+02 -1.259664e+02 -1.570589e+02 -1.229553e+02 -1.525582e+02 -1.533690e+02 
% -1.607353e+02 -1.326165e+02 -1.381888e+02 -1.396128e+02 -1.456504e+02 -1.446576e+02 
PHSYX=[
 1.312164e+02 -1.259664e+02 -1.570589e+02 -1.229553e+02 -1.525582e+02 -1.533690e+02 
-1.607353e+02 -1.326165e+02 -1.381888e+02 -1.396128e+02 -1.456504e+02 -1.446576e+02 
];
disp('PHSYX =')
disp(PHSYX)
% 展示WinGLink資料:
% PHSYX =
%   131.2164 -125.9664 -157.0589 -122.9553 -152.5582 -153.3690
%  -160.7353 -132.6165 -138.1888 -139.6128 -145.6504 -144.6576
yeh_PHSYX=angle(complex(ZYXR,ZYXI))*180/pi;
disp('yeh_PHSYX =')
disp(yeh_PHSYX)
% 展示驗證結果:
% yeh_PHSYX =
%   131.2164 -125.9664 -157.0589 -122.9553 -152.5582 -153.3690
%  -160.7353 -132.6166 -138.1888 -139.6128 -145.6504 -144.6576
%--
% WinGLink檔案內容:
% >PHSYX.ERR ROT=RHOROT //12
%  5.844337e-01  1.039162e+00  1.752549e+00  3.612165e-01  1.156842e-01  3.848019e-01 
%  1.132723e+01  6.218739e-01  4.573779e-01  1.411995e+00  3.122803e+00  3.450162e-01 
PHSYXERR=[
 5.844337e-01  1.039162e+00  1.752549e+00  3.612165e-01  1.156842e-01  3.848019e-01 
 1.132723e+01  6.218739e-01  4.573779e-01  1.411995e+00  3.122803e+00  3.450162e-01 
];
disp('PHSYXERR =')
disp(PHSYXERR)
% 展示WinGLink資料:
% PHSYXERR =
%     0.5844    1.0392    1.7525    0.3612    0.1157    0.3848
%    11.3272    0.6219    0.4574    1.4120    3.1228    0.3450
PHSXYYXERR_coefficient=4.051423e+01;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_PHSYXERR=PHSXYYXERR_coefficient.*sqrt(ZYXVAR)./(abs(complex(ZYXR,ZYXI)));
disp('yeh_PHSYXERR =')
disp(yeh_PHSYXERR)
% 展示驗證結果:
% yeh_PHSYXERR =
%     0.5844    1.0392    1.7525    0.3612    0.1157    0.3848
%    11.3272    0.6219    0.4574    1.4120    3.1228    0.3450
%--
% WinGLink檔案內容:
% >PHSXX ROT=RHOROT //12
%  1.394388e+02 -1.723857e+02 -1.375016e+02  1.666203e+02  1.794828e+02  9.735701e+01 
% -2.855181e+01 -1.614608e+02 -1.417424e+02 -1.420506e+02 -6.777960e+01 -1.784856e+02 
PHSXX=[
 1.394388e+02 -1.723857e+02 -1.375016e+02  1.666203e+02  1.794828e+02  9.735701e+01 
-2.855181e+01 -1.614608e+02 -1.417424e+02 -1.420506e+02 -6.777960e+01 -1.784856e+02 
];
disp('PHSXX =')
disp(PHSXX)
% 展示WinGLink資料:
% PHSXX =
%   139.4388 -172.3857 -137.5016  166.6203  179.4828   97.3570
%   -28.5518 -161.4608 -141.7424 -142.0506  -67.7796 -178.4856
yeh_PHSXX=angle(complex(ZXXR,ZXXI))*180/pi;
disp('yeh_PHSXX =')
disp(yeh_PHSXX)
% 展示驗證結果:
% yeh_PHSXX =
%   139.4388 -172.3857 -137.5016  166.6204  179.4828   97.3570
%   -28.5518 -161.4608 -141.7424 -142.0506  -67.7796 -178.4857
%--
% WinGLink檔案內容:
% >PHSXX.ERR ROT=RHOROT //12
%  9.590399e-02  2.294271e+00  1.550064e+00  4.773001e-01  1.168180e-01  7.312229e-02 
%  1.250714e+02  6.237252e+00  4.638286e+00  9.180821e-01  1.506769e+01  1.109835e+00 
PHSXXERR=[
 9.590399e-02  2.294271e+00  1.550064e+00  4.773001e-01  1.168180e-01  7.312229e-02 
 1.250714e+02  6.237252e+00  4.638286e+00  9.180821e-01  1.506769e+01  1.109835e+00 
];
disp('PHSXXERR =')
disp(PHSXXERR)
% 展示WinGLink資料:
% PHSXXERR =
%     0.0959    2.2943    1.5501    0.4773    0.1168    0.0731
%   125.0714    6.2373    4.6383    0.9181   15.0677    1.1098
PHSXXYYERR_coefficient=1.641403e+03;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_PHSXXERR=PHSXXYYERR_coefficient.*(ZXXVAR)./(abs(complex(ZXXR,ZXXI)).^2);
disp('yeh_PHSXXERR =')
disp(yeh_PHSXXERR)
% 展示驗證結果:
% yeh_PHSXXERR =
%     0.0959    2.2943    1.5501    0.4773    0.1168    0.0731
%   125.0714    6.2372    4.6383    0.9181   15.0677    1.1098
%--
% WinGLink檔案內容:
% >PHSYY ROT=RHOROT //12
% -1.213428e+02  8.075487e+00 -4.326786e+01  4.899921e-01  6.170390e+01  5.978881e+01 
%  1.576764e+01 -1.513158e+01  3.402930e+01  4.390998e+00 -2.259661e+01  7.804555e+01 
PHSYY=[
-1.213428e+02  8.075487e+00 -4.326786e+01  4.899921e-01  6.170390e+01  5.978881e+01 
 1.576764e+01 -1.513158e+01  3.402930e+01  4.390998e+00 -2.259661e+01  7.804555e+01 
];
disp('PHSYY =')
disp(PHSYY)
% 展示WinGLink資料:
% PHSYY =
%  -121.3428    8.0755  -43.2679    0.4900   61.7039   59.7888
%    15.7676  -15.1316   34.0293    4.3910  -22.5966   78.0456
yeh_PHSYY=angle(complex(ZYYR,ZYYI))*180/pi;
disp('yeh_PHSYY =')
disp(yeh_PHSYY)
% 展示驗證結果:
% yeh_PHSYY =
%  -121.3428    8.0755  -43.2679    0.4900   61.7039   59.7888
%    15.7676  -15.1316   34.0293    4.3910  -22.5966   78.0456
%--
% WinGLink檔案內容:
% >PHSYY.ERR ROT=RHOROT //12
%  8.092104e-02  8.662728e+00  1.772283e+00  5.185587e-01  4.929779e-02  3.961367e-01 
%  2.074562e+02  5.424634e-01  6.297226e+00  7.614626e-01  9.652813e+01  9.117968e-01 
PHSYYERR=[
 8.092104e-02  8.662728e+00  1.772283e+00  5.185587e-01  4.929779e-02  3.961367e-01 
 2.074562e+02  5.424634e-01  6.297226e+00  7.614626e-01  9.652813e+01  9.117968e-01 
];
disp('PHSYYERR =')
disp(PHSYYERR)
% 展示WinGLink資料:
% PHSYYERR =
%     0.0809    8.6627    1.7723    0.5186    0.0493    0.3961
%   207.4562    0.5425    6.2972    0.7615   96.5281    0.9118
PHSXXYYERR_coefficient=1.641403e+03;%不知道原因，但驗證其效果與WinGLink一致的係數。
yeh_PHSYYERR=PHSXXYYERR_coefficient.*(ZYYVAR)./(abs(complex(ZYYR,ZYYI)).^2);
disp('yeh_PHSYYERR =')
disp(yeh_PHSYYERR)
% 展示驗證結果:
% yeh_PHSYYERR =
%     0.0809    8.6627    1.7723    0.5186    0.0493    0.3961
%   207.4561    0.5425    6.2972    0.7615   96.5281    0.9118
%--
% >!****TIPPER PARAMETERS****!
% >TROT.EXP //12
%  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00 
%  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00 
%--
% WinGLink檔案內容:
% >TXR.EXP //12
%  2.058071e+00 -2.824702e-01 -1.503544e+00  3.911050e-01  1.489241e-01  6.138070e+00 
% -2.201983e+00  3.887843e-01  1.408115e-01 -4.521303e+00 -3.567144e+00 -2.250500e-01 
TXREXP=[
 2.058071e+00 -2.824702e-01 -1.503544e+00  3.911050e-01  1.489241e-01  6.138070e+00 
-2.201983e+00  3.887843e-01  1.408115e-01 -4.521303e+00 -3.567144e+00 -2.250500e-01 
];
%--
% WinGLink檔案內容:
% >TXI.EXP //12
%  3.283516e-01  1.218156e-01 -1.409276e-03  7.742186e-01 -2.090903e-01 -3.092054e-01 
%  1.275629e+00  5.430256e-01 -1.904138e-01  1.299028e+00 -1.431494e+00 -2.203917e-01 
TXIEXP=[
 3.283516e-01  1.218156e-01 -1.409276e-03  7.742186e-01 -2.090903e-01 -3.092054e-01 
 1.275629e+00  5.430256e-01 -1.904138e-01  1.299028e+00 -1.431494e+00 -2.203917e-01 
];
%--
% WinGLink檔案內容:
% >TXVAR.EXP //12
%  4.937917e-04  1.192396e-03  2.095873e-02  6.791493e-05  1.814064e-05  5.722934e-03 
%  1.473388e+00  4.760544e-04  4.386022e-04  4.371189e-02  1.208756e-01  7.546045e-05 
TXVAREXP=[
 4.937917e-04  1.192396e-03  2.095873e-02  6.791493e-05  1.814064e-05  5.722934e-03 
 1.473388e+00  4.760544e-04  4.386022e-04  4.371189e-02  1.208756e-01  7.546045e-05 
];
%--
% WinGLink檔案內容:
% >TYR.EXP //12
% -1.107078e+00  1.763063e-01 -1.675454e-01  2.014153e-01 -2.540140e-01  3.333664e+00 
% -1.614435e+00 -7.145736e-02  2.412092e-01  2.098823e+00  1.162961e+00  3.294640e-01 
TYREXP=[
-1.107078e+00  1.763063e-01 -1.675454e-01  2.014153e-01 -2.540140e-01  3.333664e+00 
-1.614435e+00 -7.145736e-02  2.412092e-01  2.098823e+00  1.162961e+00  3.294640e-01 
];
%--
% WinGLink檔案內容:
% >TYI.EXP //12
%  3.203560e-01  1.923024e-01  5.067342e-01  1.049631e+00 -2.098480e-01 -2.797966e+00 
% -2.841784e+00  7.025797e-01  1.730731e-01 -4.711779e-01 -8.023845e-01  9.469505e-02 
TYIEXP=[
 3.203560e-01  1.923024e-01  5.067342e-01  1.049631e+00 -2.098480e-01 -2.797966e+00 
-2.841784e+00  7.025797e-01  1.730731e-01 -4.711779e-01 -8.023845e-01  9.469505e-02 
];
%--
% WinGLink檔案內容:
% >TYVAR.EXP //12
%  9.604295e-05  4.351671e-04  2.108007e-03  8.599649e-05  1.361060e-05  1.649784e-03 
%  3.008819e-01  2.806941e-04  4.407845e-04  2.184752e-02  4.522566e-02  1.759164e-04 
TYVAREXP=[
 9.604295e-05  4.351671e-04  2.108007e-03  8.599649e-05  1.361060e-05  1.649784e-03 
 3.008819e-01  2.806941e-04  4.407845e-04  2.184752e-02  4.522566e-02  1.759164e-04 
];
%--
% WinGLink檔案內容:
% >TIPMAG //12
%  2.381537e+00  4.033517e-01  1.595462e+00  1.376470e+00  4.176798e-01  7.530832e+00 
%  4.142233e+00  9.719848e-01  3.797650e-01  5.172689e+00  4.095118e+00  4.655467e-01 
TIPMAG=[
 2.381537e+00  4.033517e-01  1.595462e+00  1.376470e+00  4.176798e-01  7.530832e+00 
 4.142233e+00  9.719848e-01  3.797650e-01  5.172689e+00  4.095118e+00  4.655467e-01 
];
disp('TIPMAG =')
disp(TIPMAG)
% 展示WinGLink資料:
% TIPMAG =
%     2.3815    0.4034    1.5955    1.3765    0.4177    7.5308
%     4.1422    0.9720    0.3798    5.1727    4.0951    0.4655
yeh_TIPMAG=sqrt(abs(complex(TXREXP,TXIEXP).^2)+abs(complex(TYREXP,TYIEXP)).^2);
disp('yeh_TIPMAG =')
disp(yeh_TIPMAG)
% 展示驗證結果:
% yeh_TIPMAG =
%     2.3815    0.4034    1.5955    1.3765    0.4177    7.5308
%     4.1422    0.9720    0.3798    5.1727    4.0951    0.4655
%--
% WinGLink檔案內容:
% >TIPMAG.VAR //12
%  1.394759e-04  6.922850e-04  9.153411e-03  1.660469e-05  6.907182e-06  2.159652e-03 
%  3.718844e-01  1.896962e-04  2.116321e-04  4.138491e-02  6.262799e-02  9.144047e-05 
TIPMAGVAR=[
 1.394759e-04  6.922850e-04  9.153411e-03  1.660469e-05  6.907182e-06  2.159652e-03 
 3.718844e-01  1.896962e-04  2.116321e-04  4.138491e-02  6.262799e-02  9.144047e-05 
];
disp('TIPMAGVAR =')
disp(TIPMAGVAR)
% 展示WinGLink資料:
% TIPMAGVAR =
%     0.0001    0.0007    0.0092    0.0000    0.0000    0.0022
%     0.3719    0.0002    0.0002    0.0414    0.0626    0.0001
yeh_TIPMAGVAR=sqrt(TXVAREXP.^2+TYVAREXP.^2)
disp('yeh_TIPMAGVAR =')
disp(yeh_TIPMAGVAR)
% 展示驗證結果:
% yeh_TIPMAGVAR =
%     0.0005    0.0013    0.0211    0.0001    0.0000    0.0060
%     1.5038    0.0006    0.0006    0.0489    0.1291    0.0002
%--
% >TIPPHS //12
%  4.531626e+01  1.109923e+02 -1.476909e+02  7.280822e+01 -1.079924e+02 -1.528273e+01 
% -1.787767e+01  7.625793e+01  9.807560e-01  1.334264e+02 -1.434293e+02 -5.338221e+01 
TIPPHS=[
 4.531626e+01  1.109923e+02 -1.476909e+02  7.280822e+01 -1.079924e+02 -1.528273e+01 
-1.787767e+01  7.625793e+01  9.807560e-01  1.334264e+02 -1.434293e+02 -5.338221e+01 
];
disp('TIPPHS =')
disp(TIPPHS)
% 展示WinGLink資料:
% TIPPHS =
%    45.3163  110.9923 -147.6909   72.8082 -107.9924  -15.2827
%   -17.8777   76.2579    0.9808  133.4264 -143.4293  -53.3822
yeh_TIPPHS=( ((abs(complex(TXREXP,TXIEXP)).^2).*angle(complex(TXREXP,TXIEXP))) + ((abs(complex(TYREXP,TYIEXP)).^2).*angle(complex(TYREXP,TYIEXP)))  )./( abs(complex(TXREXP,TXIEXP)).^2+abs(complex(TYREXP,TYIEXP)).^2 )*180/pi;
disp('yeh_TIPPHS =')
disp(yeh_TIPPHS)
% 展示驗證結果:
% yeh_TIPPHS =
%    45.3162  110.9923 -147.6909   72.8082 -107.9924  -15.2827
%   -17.8777   76.2579    0.9808  133.4264 -143.4293  -53.3822
%--------------------------------------------------------------------------

